app/Controllers/MenuController.php

        public function tampil()
        {
            #code...
            $data['data']= $this->menus->findAll();
---
SELECT *
FROM `tb_menu`