app/Controllers/PesananController.php

SELECT `id`, `nama`
FROM `tb_menu`
---
    public function index()
    {
        $data['data'] = $this->menu->select('id,nama')->findAll();

SELECT *
FROM `tb_menu`
WHERE `tb_menu`.`id` = '199'
---
    public function addCart()
    {
        $id = $this->request->getPost('menu_id');
        $jumlah = $this->request->getPost('jumlah');
        $menu=$this->menu->find($id);