app/Controllers/UserController.php

    public function index()
    {
        #code...
        $data['data']= $this->users->findAll();
---
SELECT *
FROM `tb_user`

    public function simpan()
    {
        #code...
        $data = array(
            'nama'=>$this->request->getPost('nama'),
            'username'=>$this->request->getPost('username'),
            'password'=>password_hash($this->request->getPost('password'),PASSWORD_DEFAULT),
            'role'=>$this->request->getPost('role'),
        );
        $this->users->insert($data);
---
INSERT INTO `tb_user` (`nama`, `username`, `password`, `role`) VALUES ('cintiaaa', 'cintiaaa', '$2y$10$Hh91lo2jyoA.7B0AQ0vzMedXSTHkVOBKHk3C16juE8twGZl0M.qNO', 'kasir')